stm32duino/Arduino_Core_STM32/boards.txt
# DEMO_F030F4_16M board
GenF0.menu.pnum.DEMO_F030F4_16M=STM32F030F4 Demo board (16Mhz)
GenF0.menu.pnum.DEMO_F030F4_16M.upload.maximum_data_size=4096
GenF0.menu.pnum.DEMO_F030F4_16M.upload.maximum_size=16384
GenF0.menu.pnum.DEMO_F030F4_16M.build.board=DEMO_F030F4_16M
GenF0.menu.pnum.DEMO_F030F4_16M.build.product_line=STM32F030x6
GenF0.menu.pnum.DEMO_F030F4_16M.build.variant=DEMO_F030F4

# DEMO_F030F4_HSI board
GenF0.menu.pnum.DEMO_F030F4_HSI=STM32F030F4 Demo board (internal RC oscillator)
GenF0.menu.pnum.DEMO_F030F4_HSI.upload.maximum_data_size=4096
GenF0.menu.pnum.DEMO_F030F4_HSI.upload.maximum_size=16384
GenF0.menu.pnum.DEMO_F030F4_HSI.build.board=DEMO_F030F4_HSI
GenF0.menu.pnum.DEMO_F030F4_HSI.build.product_line=STM32F030x6
GenF0.menu.pnum.DEMO_F030F4_HSI.build.variant=DEMO_F030F4

# Upload menu
GenF0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF0.menu.upload_method.swdMethod.upload.protocol=0
GenF0.menu.upload_method.swdMethod.upload.options=-g
GenF0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF0.menu.upload_method.serialMethod.upload.protocol=1
GenF0.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF0.menu.upload_method.dfuMethod.upload.protocol=2
GenF0.menu.upload_method.dfuMethod.upload.options=-g
GenF0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic F1
GenF1.name=Generic STM32F1 series

GenF1.build.core=arduino
GenF1.build.board=GenF1
GenF1.build.mcu=cortex-m3
GenF1.build.series=STM32F1xx
GenF1.build.cmsis_lib_gcc=arm_cortexM3l_math
GenF1.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}

# BLUEPILL_F103C6 board
GenF1.menu.pnum.BLUEPILL_F103C6=BluePill F103C6 (32K)
GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_size=32768
GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_data_size=10240
GenF1.menu.pnum.BLUEPILL_F103C6.build.board=BLUEPILL_F103C6
GenF1.menu.pnum.BLUEPILL_F103C6.build.product_line=STM32F103x6
GenF1.menu.pnum.BLUEPILL_F103C6.build.variant=PILL_F103XX

# BLUEPILL_F103C8 board
GenF1.menu.pnum.BLUEPILL_F103C8=BluePill F103C8
GenF1.menu.pnum.BLUEPILL_F103C8.upload.maximum_size=65536
GenF1.menu.pnum.BLUEPILL_F103C8.upload.maximum_data_size=20480
GenF1.menu.pnum.BLUEPILL_F103C8.build.board=BLUEPILL_F103C8
GenF1.menu.pnum.BLUEPILL_F103C8.build.product_line=STM32F103xB
GenF1.menu.pnum.BLUEPILL_F103C8.build.variant=PILL_F103XX

GenF1.menu.pnum.BLUEPILL_F103CB=BluePill F103CB (or C8 with 128k)
GenF1.menu.pnum.BLUEPILL_F103CB.upload.maximum_size=131072
GenF1.menu.pnum.BLUEPILL_F103CB.upload.maximum_data_size=20480
GenF1.menu.pnum.BLUEPILL_F103CB.build.board=BLUEPILL_F103CB
GenF1.menu.pnum.BLUEPILL_F103CB.build.product_line=STM32F103xB
GenF1.menu.pnum.BLUEPILL_F103CB.build.variant=PILL_F103XX

# BLACKPILL_F103C8 board
GenF1.menu.pnum.BLACKPILL_F103C8=BlackPill F103C8
GenF1.menu.pnum.BLACKPILL_F103C8.upload.maximum_size=65536
GenF1.menu.pnum.BLACKPILL_F103C8.upload.maximum_data_size=20480
GenF1.menu.pnum.BLACKPILL_F103C8.build.board=BLACKPILL_F103C8
GenF1.menu.pnum.BLACKPILL_F103C8.build.product_line=STM32F103xB
GenF1.menu.pnum.BLACKPILL_F103C8.build.variant=PILL_F103XX

GenF1.menu.pnum.BLACKPILL_F103CB=BlackPill F103CB (or C8 with 128k)
GenF1.menu.pnum.BLACKPILL_F103CB.upload.maximum_size=131072
GenF1.menu.pnum.BLACKPILL_F103CB.upload.maximum_data_size=20480
GenF1.menu.pnum.BLACKPILL_F103CB.build.board=BLACKPILL_F103CB
GenF1.menu.pnum.BLACKPILL_F103CB.build.product_line=STM32F103xB
GenF1.menu.pnum.BLACKPILL_F103CB.build.variant=PILL_F103XX

# Generic STM32F103Rx boards (Blue button)
GenF1.menu.pnum.Generic_F103R8T6=Generic F103R8T6 (Blue Button)
GenF1.menu.pnum.Generic_F103R8T6.upload.maximum_size=65536
GenF1.menu.pnum.Generic_F103R8T6.upload.maximum_data_size=20480
GenF1.menu.pnum.Generic_F103R8T6.build.board=GENERIC_F103R8T6
GenF1.menu.pnum.Generic_F103R8T6.build.product_line=STM32F103xB
GenF1.menu.pnum.Generic_F103R8T6.build.variant=Generic_F103Rx

GenF1.menu.pnum.Generic_F103RBT6=Generic F103RBT6 (Blue Button)
GenF1.menu.pnum.Generic_F103RBT6.upload.maximum_size=131072
GenF1.menu.pnum.Generic_F103RBT6.upload.maximum_data_size=20480
GenF1.menu.pnum.Generic_F103RBT6.build.board=GENERIC_F103RBT6
GenF1.menu.pnum.Generic_F103RBT6.build.product_line=STM32F103xB
GenF1.menu.pnum.Generic_F103RBT6.build.variant=Generic_F103Rx

GenF1.menu.pnum.Generic_F103RCT6=Generic F103RCT6 (Blue Button)
GenF1.menu.pnum.Generic_F103RCT6.upload.maximum_size=262144
GenF1.menu.pnum.Generic_F103RCT6.upload.maximum_data_size=49152
GenF1.menu.pnum.Generic_F103RCT6.build.board=GENERIC_F103RCT6
GenF1.menu.pnum.Generic_F103RCT6.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103RCT6.build.variant=Generic_F103Rx

GenF1.menu.pnum.Generic_F103RET6=Generic F103RET6 (Blue Button)
GenF1.menu.pnum.Generic_F103RET6.upload.maximum_size=524288
GenF1.menu.pnum.Generic_F103RET6.upload.maximum_data_size=65536
GenF1.menu.pnum.Generic_F103RET6.build.board=GENERIC_F103RET6
GenF1.menu.pnum.Generic_F103RET6.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103RET6.build.variant=Generic_F103Rx

# Generic STM32F103Zx boards
GenF1.menu.pnum.Generic_F103ZC=Generic F103ZC
GenF1.menu.pnum.Generic_F103ZC.upload.maximum_size=262144
GenF1.menu.pnum.Generic_F103ZC.upload.maximum_data_size=49152
GenF1.menu.pnum.Generic_F103ZC.build.board=Generic_F103ZC
GenF1.menu.pnum.Generic_F103ZC.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103ZC.build.variant=Generic_F103Zx

GenF1.menu.pnum.Generic_F103ZD=Generic F103ZD
GenF1.menu.pnum.Generic_F103ZD.upload.maximum_size=393216
GenF1.menu.pnum.Generic_F103ZD.upload.maximum_data_size=65536
GenF1.menu.pnum.Generic_F103ZD.build.board=Generic_F103ZC
GenF1.menu.pnum.Generic_F103ZD.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103ZD.build.variant=Generic_F103Zx

GenF1.menu.pnum.Generic_F103ZE=Generic F103ZE
GenF1.menu.pnum.Generic_F103ZE.upload.maximum_size=524288
GenF1.menu.pnum.Generic_F103ZE.upload.maximum_data_size=65536
GenF1.menu.pnum.Generic_F103ZE.build.board=Generic_F103ZE
GenF1.menu.pnum.Generic_F103ZE.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103ZE.build.variant=Generic_F103Zx

GenF1.menu.pnum.Generic_F103ZF=Generic F103ZF
GenF1.menu.pnum.Generic_F103ZF.upload.maximum_size=786432
GenF1.menu.pnum.Generic_F103ZF.upload.maximum_data_size=98304
GenF1.menu.pnum.Generic_F103ZF.build.board=Generic_F103ZF
GenF1.menu.pnum.Generic_F103ZF.build.product_line=STM32F103xG
GenF1.menu.pnum.Generic_F103ZF.build.variant=Generic_F103Zx

GenF1.menu.pnum.Generic_F103ZG=Generic F103ZG
GenF1.menu.pnum.Generic_F103ZG.upload.maximum_size=1048576
GenF1.menu.pnum.Generic_F103ZG.upload.maximum_data_size=98304
GenF1.menu.pnum.Generic_F103ZG.build.board=Generic_F103ZG
GenF1.menu.pnum.Generic_F103ZG.build.product_line=STM32F103xG
GenF1.menu.pnum.Generic_F103ZG.build.variant=Generic_F103Zx

# VCCGND_F103ZET6 board
GenF1.menu.pnum.VCCGND_F103ZET6Mini=VCCGND F103ZET6 Mini
GenF1.menu.pnum.VCCGND_F103ZET6Mini.upload.maximum_size=524288
GenF1.menu.pnum.VCCGND_F103ZET6Mini.upload.maximum_data_size=65536
GenF1.menu.pnum.VCCGND_F103ZET6Mini.build.board=VCCGND_F103ZET6_MINI
GenF1.menu.pnum.VCCGND_F103ZET6Mini.build.product_line=STM32F103xE
GenF1.menu.pnum.VCCGND_F103ZET6Mini.build.variant=Generic_F103Zx

GenF1.menu.pnum.VCCGND_F103ZET6=VCCGND F103ZET6
GenF1.menu.pnum.VCCGND_F103ZET6.upload.maximum_size=524288
GenF1.menu.pnum.VCCGND_F103ZET6.upload.maximum_data_size=65536
GenF1.menu.pnum.VCCGND_F103ZET6.build.board=VCCGND_F103ZET6
GenF1.menu.pnum.VCCGND_F103ZET6.build.product_line=STM32F103xE
GenF1.menu.pnum.VCCGND_F103ZET6.build.variant=Generic_F103Zx

# HY-TinySTM103TB board
GenF1.menu.pnum.HY_TinySTM103TB=HY-TinySTM103TB
GenF1.menu.pnum.HY_TinySTM103TB.upload.maximum_size=131072
GenF1.menu.pnum.HY_TinySTM103TB.upload.maximum_data_size=20480
GenF1.menu.pnum.HY_TinySTM103TB.build.board=HY_TinySTM103TB
GenF1.menu.pnum.HY_TinySTM103TB.build.product_line=STM32F103xB
GenF1.menu.pnum.HY_TinySTM103TB.build.variant=HY_TinySTM103T

# MAPLEMINI_F103CB board
GenF1.menu.pnum.MAPLEMINI_F103CB=Maple Mini F103CB
GenF1.menu.pnum.MAPLEMINI_F103CB.upload.maximum_size=131072
GenF1.menu.pnum.MAPLEMINI_F103CB.upload.maximum_data_size=20480
GenF1.menu.pnum.MAPLEMINI_F103CB.build.board=MAPLEMINI_F103CB
GenF1.menu.pnum.MAPLEMINI_F103CB.build.product_line=STM32F103xB
GenF1.menu.pnum.MAPLEMINI_F103CB.build.variant=MAPLEMINI_F103CB


# Upload menu
GenF1.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF1.menu.upload_method.swdMethod.upload.protocol=0
GenF1.menu.upload_method.swdMethod.upload.options=-g
GenF1.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF1.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF1.menu.upload_method.serialMethod.upload.protocol=1
GenF1.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF1.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

