stm32duino/Arduino_Core_STM32/boards.txt
GenL0.menu.rtlib.nano=Newlib Nano (default)
GenL0.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenL0.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenL0.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenL0.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenL0.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenL0.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenL0.menu.rtlib.full=Newlib Standard
GenL0.menu.rtlib.full.build.flags.ldspecs=

ESC_board.menu.rtlib.nano=Newlib Nano (default)
ESC_board.menu.rtlib.nanofp=Newlib Nano + Float Printf
ESC_board.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
ESC_board.menu.rtlib.nanofs=Newlib Nano + Float Scanf
ESC_board.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
ESC_board.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
ESC_board.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
ESC_board.menu.rtlib.full=Newlib Standard
ESC_board.menu.rtlib.full.build.flags.ldspecs=

LoRa.menu.rtlib.nano=Newlib Nano (default)
LoRa.menu.rtlib.nanofp=Newlib Nano + Float Printf
LoRa.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
LoRa.menu.rtlib.nanofs=Newlib Nano + Float Scanf
LoRa.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
LoRa.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
LoRa.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
LoRa.menu.rtlib.full=Newlib Standard
LoRa.menu.rtlib.full.build.flags.ldspecs=

3dprinter.menu.rtlib.nano=Newlib Nano (default)
3dprinter.menu.rtlib.nanofp=Newlib Nano + Float Printf
3dprinter.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
3dprinter.menu.rtlib.nanofs=Newlib Nano + Float Scanf
3dprinter.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
3dprinter.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
3dprinter.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
3dprinter.menu.rtlib.full=Newlib Standard
3dprinter.menu.rtlib.full.build.flags.ldspecs=

Genericflight.menu.rtlib.nano=Newlib Nano (default)
Genericflight.menu.rtlib.nanofp=Newlib Nano + Float Printf
Genericflight.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Genericflight.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Genericflight.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Genericflight.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Genericflight.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Genericflight.menu.rtlib.full=Newlib Standard
Genericflight.menu.rtlib.full.build.flags.ldspecs=

Midatronics.menu.rtlib.nano=Newlib Nano (default)
Midatronics.menu.rtlib.nanofp=Newlib Nano + Float Printf
Midatronics.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Midatronics.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Midatronics.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Midatronics.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Midatronics.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Midatronics.menu.rtlib.full=Newlib Standard
Midatronics.menu.rtlib.full.build.flags.ldspecs=
